Revit 2027 API
ViewSchedule.RestoreImageSize Method
 Restores all images to their original sizes.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RestoreImageSize()
Public Sub RestoreImageSize
public:
void RestoreImageSize()
member RestoreImageSize : unit -> unit
Remarks
All images in the schedule will be restored to their original sizes when viewed as a ScheduleSheetInstance on a ViewSheet. This reverts any changes made by setting RowHeight. Calling this method has no effect if HasImageField is false.
In the schedule view the column widths will be adjusted to match the image sizes, but only the name of the image will be shown. For example, the users can attach different images to the kinds of rebar instances. These images may have different sizes. When the users create the rebar schedule with this image field, by default the column width of this image field is equal to other fields, which means it is not associated with the image original sizes during the schedule creation.
See Also
Reference
ViewSchedule Class
Autodesk.Revit.DB Namespace